app/controllers/tokimons_controller.rb

SELECT  "tokimons".* FROM "tokimons" WHERE "tokimons"."id" = $1 LIMIT 1  [["id", 0]]
---
	def show
		@tokimon = Tokimon.find(params[:id])

SELECT "tokimons".* FROM "tokimons"
---
	def index
		@tokimons = Tokimon.all

INSERT INTO "tokimons" ("name", "weight", "height", "fight", "electric", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "pika"], ["weight", 1], ["height", 2], ["fight", 2], ["electric", 10], ["created_at", "2016-10-15 11:12:15.881558"], ["updated_at", "2016-10-15 11:12:15.881558"]]
---
	def create
		@tokimon = Tokimon.new(tokimon_params)
		if @tokimon.save

SELECT  "tokimons".* FROM "tokimons" WHERE "tokimons"."id" = $1 LIMIT 1  [["id", 4]]
---
	def edit
		@tokimon = Tokimon.find(params[:id])

SELECT  "tokimons".* FROM "tokimons" WHERE "tokimons"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "tokimons" SET "name" = $1, "updated_at" = $2 WHERE "tokimons"."id" = $3  [["name", "bye"], ["updated_at", "2016-10-15 10:22:08.792181"], ["id", 4]]
---
	def update
		@tokimon = Tokimon.find(params[:id])
		if @tokimon.update_attributes(tokimon_params)

SELECT  "tokimons".* FROM "tokimons" WHERE "tokimons"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "tokimons" WHERE "tokimons"."id" = $1  [["id", 5]]
---
	def delete
		@tokimon = Tokimon.find(params[:id])
		Tokimon.find(params[:id]).destroy