app/controllers/trainers_controller.rb

	def show
		@trainer = Trainer.find(params[:id])
---
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = $1 LIMIT 1  [["id", 1]]

	def create
		@trainer = Trainer.new(trainer_params)
		@trainer.save
---
INSERT INTO "trainers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Cindy"], ["created_at", "2016-10-15 12:34:51.318192"], ["updated_at", "2016-10-15 12:34:51.318192"]]